app/views/books/show.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  	Libro in prestito a
  	<%= User.find(@book.user_id).surname %>