app/controllers/books_controller.rb

  def show
    @book = Book.find(params[:id])
    @comment_sent = flash[:comment]
    if not @book.available_for_rent?
      @whohasit = User.find(@book.user_id).surname
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def index
    @books = Book.all
---
SELECT `books`.* FROM `books`

  def edit
    @book = Book.find(params[:id])
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1

  def send_comment
    @book = Book.find(params[:id])
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1

  def update
    patch_attributes = params.require(:book).permit(:user_id)
    @book = Book.find(params[:id])
    @book.update(patch_attributes)
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1
UPDATE `books` SET `user_id` = 2, `updated_at` = '2015-12-23 13:30:02' WHERE `books`.`id` = 2