app/controllers/categories_controller.rb

INSERT INTO `categories` (`category`, `created_at`, `updated_at`) VALUES ('Giallo', '2015-12-23 15:37:28', '2015-12-23 15:37:28')
---
  def create
    logger.info "CREATE"
    @category = Category.new(params[:category])
    if not @category.category.nil?
      @category.save

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1
DELETE FROM `categories` WHERE `categories`.`id` = 3
---
  def destroy
    logger.info "DESTROY"
    @category = Category.find(params[:id])
    @category.destroy